---
kind: type
id: T:Autodesk.Revit.DB.ViewPlanType
source: html/52b74ffe-5460-85bb-b68d-002fa32035b1.htm
---
# Autodesk.Revit.DB.ViewPlanType

An enumerated type listing plan view types.

## Syntax (C#)
```csharp
public enum ViewPlanType
```